## Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from numpy import nan as NA
df5 = pd.DataFrame([[1, 6.5, 3], [1.2, NA, NA], [NA, NA, 3.3], [NA, 6.0, NA]])
df5

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

#### 기술 통계 함수

In [ ]:
# 기술통계 요약
# describe
# 기본적으로 숫자 열만 포함
# 다른 열도 다 포함시키고 싶을 경우 include='all' 옵션
df5.describe()

              0         1         2
count  2.000000  2.000000  2.000000
mean   1.100000  6.250000  3.150000
std    0.141421  0.353553  0.212132
min    1.000000  6.000000  3.000000
25%    1.050000  6.125000  3.075000
50%    1.100000  6.250000  3.150000
75%    1.150000  6.375000  3.225000
max    1.200000  6.500000  3.300000

In [ ]:
# object 타입의 열은 숫자형에 적용되는 계산이 대부분 불가능함
# 대신 unique, top, freq 등의 값이 출력됨
df6 = df5.copy()
df6['A'] = ['하이', '하이', NA, '바이']
df6

     0    1    2    A
0  1.0  6.5  3.0   하이
1  1.2  NaN  NaN   하이
2  NaN  NaN  3.3  NaN
3  NaN  6.0  NaN   바이

In [ ]:
df6.describe(include='all')

               0         1         2    A
count   2.000000  2.000000  2.000000    3
unique       NaN       NaN       NaN    2
top          NaN       NaN       NaN   하이
freq         NaN       NaN       NaN    2
mean    1.100000  6.250000  3.150000  NaN
std     0.141421  0.353553  0.212132  NaN
min     1.000000  6.000000  3.000000  NaN
25%     1.050000  6.125000  3.075000  NaN
50%     1.100000  6.250000  3.150000  NaN
75%     1.150000  6.375000  3.225000  NaN
max     1.200000  6.500000  3.300000  NaN

In [ ]:
# 데이터프레임의 정보 확인
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      float64
 1   1       2 non-null      float64
 2   2       2 non-null      float64
dtypes: float64(3)
memory usage: 224.0 bytes

In [ ]:
df6

     0    1    2    A
0  1.0  6.5  3.0   하이
1  1.2  NaN  NaN   하이
2  NaN  NaN  3.3  NaN
3  NaN  6.0  NaN   바이

In [ ]:
# 통계 함수
# 축 값에 따라 출력 결과 다름
# axis=0 열 별 계산 (기본)
# axis=1 행 별 계산
# skipna 판다스 통계 함수는 기본적으로 na를 배제하고 연산
# skipna=False로 지정하면 na가 포함되므로 연산 결과는 na
df6.sum(axis=0)

0     2.2
1    12.5
2     6.3
dtype: float64

In [ ]:
# 행 별 합
df6.sum(axis=1)

0    10.5
1     1.2
2     3.3
3     6.0
dtype: float64

In [ ]:
df6.sum(axis=0, skipna=False)

0   NaN
1   NaN
2   NaN
dtype: float64

In [ ]:
# 열 별 평균
df6.mean()

0    1.10
1    6.25
2    3.15
dtype: float64

In [ ]:
# 열 별 중앙값
df6.median()

0    1.10
1    6.25
2    3.15
dtype: float64

In [ ]:
# 최빈값
df = pd.DataFrame(np.random.randint(0, 5, (10,10)), index=list('abcdefghij'), columns=list('ABCDEFGHIJ'))

df.mode()

     A    B    C  D  E    F    G    H    I    J
0  4.0  2.0  0.0  0  1  0.0  0.0  4.0  3.0  1.0
1  NaN  NaN  NaN  4  2  NaN  NaN  NaN  NaN  NaN

In [ ]:
df['D'].value_counts()

4    3
0    3
1    2
3    1
2    1
Name: D, dtype: int64

In [ ]:
# 분산
df = pd.DataFrame(np.random.randint(1, 10000, (10,10)), index=list('abcdefghij'), columns=list('ABCDEFGHIJ'))
df.var()

A    3.930387e+06
B    8.803567e+06
C    9.221000e+06
D    1.125299e+07
E    8.134941e+06
F    5.918852e+06
G    9.350469e+06
H    1.004205e+07
I    4.830529e+06
J    3.109906e+06
dtype: float64

In [ ]:
# 표준 편차
df.std()

A    3541.805285
B    3239.974254
C    2771.367581
D    3125.057761
E    3234.369319
F    2329.974296
G    2750.109258
H    2666.462409
I    2662.827455
J    2244.363164
dtype: float64

In [ ]:
# 왜도
df.skew()

A    0.559963
B   -0.021820
C    0.014712
D   -0.051670
E   -0.808089
F    0.819365
G   -0.614697
H   -0.128826
I    0.902372
J   -0.829622
dtype: float64

In [ ]:
# 첨도
df.kurtosis()

A   -1.453728
B   -1.785472
C   -0.316548
D   -1.313297
E   -0.409576
F    0.006100
G   -0.223501
H   -1.765389
I   -0.161966
J    0.449520
dtype: float64

In [ ]:
# count 요소 개수
# na 제외
df6.count()

0    2
1    2
2    2
A    3
dtype: int64

In [ ]:
# 분위수
# q= 분위수를 전달하면 그에 해당하는 값 출력
# 50% (중앙값 median)
df.quantile(q=0.5)

A    3068.0
B    5034.0
C    5167.0
D    4604.0
E    7028.0
F    2702.5
G    5357.5
H    5231.0
I    2002.0
J    5776.5
Name: 0.5, dtype: float64

In [ ]:
# 25%
df.quantile(q=0.25)

A    1192.00
B    1279.00
C    3508.50
D    3090.50
E    4564.50
F    1317.00
G    4160.50
H    2704.50
I     899.25
J    4207.50
Name: 0.25, dtype: float64

In [ ]:
# 75%
df.quantile(q=0.75)

A    7404.75
B    6973.50
C    6219.75
D    7774.25
E    8874.25
F    4311.00
G    7892.25
H    7201.50
I    4287.75
J    7246.25
Name: 0.75, dtype: float64

In [ ]:
# 분위수 외 임의의 위치를 전달해도 출력
df.quantile(q=0.2)

A     936.4
B    1204.4
C    2938.0
D    2640.0
E    4005.8
F    1195.8
G    3887.0
H    2399.6
I     780.8
J    4043.6
Name: 0.2, dtype: float64

In [ ]:
# 누적합, 누적곱
df5.cumsum(skipna=True)

     0     1    2
0  1.0   6.5  3.0
1  2.2   NaN  NaN
2  NaN   NaN  6.3
3  NaN  12.5  NaN

In [ ]:
df5.cumprod(skipna=True)

     0     1    2
0  1.0   6.5  3.0
1  1.2   NaN  NaN
2  NaN   NaN  9.9
3  NaN  39.0  NaN

In [ ]:
df7 = pd.DataFrame(np.arange(1, 25).reshape(6,4), columns=list('ABCD'))
df7

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [ ]:
# 증가율
df7.pct_change()

          A         B         C         D
0       NaN       NaN       NaN       NaN
1  4.000000  2.000000  1.333333  1.000000
2  0.800000  0.666667  0.571429  0.500000
3  0.444444  0.400000  0.363636  0.333333
4  0.307692  0.285714  0.266667  0.250000
5  0.235294  0.222222  0.210526  0.200000

In [ ]:
# 상관 관계
df8 = pd.DataFrame(np.random.randint(1, 10000, (10,10)), index=list('abcdefghij'), columns=list('ABCDEFGHIJ'))
df8

      A     B     C     D     E     F     G     H     I     J
a   442  4724  1076   110  4906  5370  9877  3630  9173  4134
b  6756  3729   128  8183  9180  5394  9810  6459  1079  2353
c  1605  9738  2195  9691  2925  7343   371  9856  5053  8935
d  2988  1599  5629  9427    78  7150  8305  4326  9176  5932
e  4244  5570  2966  7832  2510  2562   815  5826  7170  7224
f  9126   518  9784    42  3876  2093  5489  4430  6951  8363
g  5528  5115  4302   495  3080  7522  1819  9974  3330  3669
h  6600  6792   179  8513  7545  9265  3331  2343  8958  2435
i  2937  6280  1685  3683  1833  1275  4131  4018  5777  5658
j   632  9628  3128  4939  1113  7589  8714  8409  5933  1670

In [ ]:
# 공분산
df8.cov()

              A             B  ...             I             J
A  2.393395e+06 -1.045472e+06  ...  4.444840e+05  1.940677e+06
B -1.045472e+06  4.473378e+06  ... -1.455858e+06  1.661839e+06
C  6.923855e+05 -8.993452e+04  ... -3.738171e+06  2.358696e+06
D -7.776603e+05 -2.765037e+06  ... -3.912880e+05 -2.454014e+06
E  1.536402e+05 -3.051187e+06  ...  1.625907e+06 -4.613634e+06
F  1.916154e+06 -3.689947e+06  ...  1.958497e+06 -1.767837e+06
G  8.602782e+05 -4.235918e+05  ...  1.667835e+06  7.753635e+05
H  4.655515e+05 -2.302214e+06  ... -7.346633e+04 -4.665197e+05
I  4.444840e+05 -1.455858e+06  ...  7.308730e+06  2.779072e+06
J  1.940677e+06  1.661839e+06  ...  2.779072e+06  9.628698e+06

[10 rows x 10 columns]

In [ ]:
# 상관 계수
df8.corr()

          A         B         C  ...         H         I         J
A  1.000000 -0.423757  0.231199  ... -0.303127 -0.539360  0.364171
B -0.423757  1.000000 -0.326360  ...  0.372861  0.422304 -0.555439
C  0.231199 -0.326360  1.000000  ...  0.085300 -0.021801 -0.213474
D  0.445172 -0.308795  0.232366  ... -0.308151 -0.644833  0.307208
E  0.266936  0.217643 -0.054501  ...  0.100399  0.157285 -0.099348
F  0.038385 -0.156510 -0.296477  ...  0.286735 -0.485347  0.198881
G  0.454145 -0.090811 -0.239040  ...  0.143470 -0.362993  0.606737
H -0.303127  0.372861  0.085300  ...  1.000000  0.052920 -0.470402
I -0.539360  0.422304 -0.021801  ...  0.052920  1.000000 -0.377477
J  0.364171 -0.555439 -0.213474  ... -0.470402 -0.377477  1.000000

[10 rows x 10 columns]

In [ ]:
# 이상치 확인 방법
df8 = pd.DataFrame(np.random.normal(50,10, 100), columns=list('A'))
df8

            A
0   43.321741
1   44.123755
2   43.710849
3   35.575775
4   60.936278
..        ...
95  36.430043
96  46.062852
97  40.326186
98  50.387550
99  33.944728

[100 rows x 1 columns]

In [ ]:
# A열에 이상치 두 개 추가
df8.iloc[0, 0] = 100000
df8.iloc[1, 0] = -100000

In [ ]:
df8.describe()

                   A
count     100.000000
mean       50.409228
std     14213.386509
min   -100000.000000
25%        44.795599
50%        50.252044
75%        59.562253
max    100000.000000

In [ ]:
A_std = df8.describe().loc['std', 'A']
A_mean = df8.describe().loc['mean', 'A']

In [ ]:
# 1. 2sigma (95%), 3sigma (99.7%) 이용
# 정상 데이터
df8[(df8['A']<=A_mean+A_std*2)&(df8['A']>=A_mean-A_std*2)]

            A
2   43.710849
3   35.575775
4   60.936278
5   52.187283
6   45.936210
..        ...
95  36.430043
96  46.062852
97  40.326186
98  50.387550
99  33.944728

[98 rows x 1 columns]

In [ ]:
# 이상치 2sigma
df8[(df8['A']>A_mean+A_std*2)|(df8['A']<A_mean-A_std*2)]

          A
0  100000.0
1 -100000.0

In [ ]:
# 이상치 3sigma
df8[(df8['A']>A_mean+A_std*3)|(df8['A']<A_mean-A_std*3)]

          A
0  100000.0
1 -100000.0

In [ ]:
# 2. 분위수 이용
df8_desc = df8.describe()
df8_desc

                   A
count     100.000000
mean       50.409228
std     14213.386509
min   -100000.000000
25%        44.795599
50%        50.252044
75%        59.562253
max    100000.000000

In [ ]:
# 분위 수 기준 최대 값 계산
# tukey 방식
# max = 75% + IQR*1.5
# min = 25% - IQR*1.5
A_max = df8_desc.loc['75%', 'A'] + 1.5*(df8_desc.loc['75%', 'A']-df8_desc.loc['25%', 'A'])
A_min = df8_desc.loc['25%', 'A'] - 1.5*(df8_desc.loc['75%', 'A']-df8_desc.loc['25%', 'A'])
A_max, A_min

(81.71223397970218, 22.64561845195127)

In [ ]:
# 이상치 tukey
df8[(df8['A']>A_max)|(df8['A']<A_min)]

          A
0  100000.0
1 -100000.0

In [ ]:
# carling 방식
# max = 50% + IQR*2.2
# min = 50% - IQR*2.2
A_max = df8_desc.loc['50%', 'A'] + 2.2*(df8_desc.loc['75%', 'A']-df8_desc.loc['25%', 'A'])
A_min = df8_desc.loc['50%', 'A'] - 2.2*(df8_desc.loc['75%', 'A']-df8_desc.loc['25%', 'A'])
A_max, A_min

(82.73868228329333, 17.765405202767326)

In [ ]:
# 이상치 carling
df8[(df8['A']>A_max)|(df8['A']<A_min)]

          A
0  100000.0
1 -100000.0

In [ ]:
df8.nlargest(2, 'A')

      A     B     C     D     E     F     G     H     I     J
f  9126   518  9784    42  3876  2093  5489  4430  6951  8363
b  6756  3729   128  8183  9180  5394  9810  6459  1079  2353

In [ ]:
df8.loc['b', 'A'] =9126

In [ ]:
df8.nlargest(2, ['A', 'B'])

      A     B     C     D     E     F     G     H     I     J
b  9126  3729   128  8183  9180  5394  9810  6459  1079  2353
f  9126   518  9784    42  3876  2093  5489  4430  6951  8363

In [ ]:
df8.nsmallest(2, 'A')

     A     B     C     D     E     F     G     H     I     J
a  442  4724  1076   110  4906  5370  9877  3630  9173  4134
j  632  9628  3128  4939  1113  7589  8714  8409  5933  1670

In [ ]:
display(df8['A'].nlargest(2))
display(df8['A'].nsmallest(2))

b    9126
f    9126
Name: A, dtype: int64

a    442
j    632
Name: A, dtype: int64

#### 결측치 처리
 - 결측치는 NaN(Not a Number) 혹은 NA(Not Available)로 처리

In [ ]:
df5

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

In [ ]:
# 결측치 조회
# isna, isnull, notna, notnull 함수
# isna == isnull 같은 기능을 하는 함수
# notna == notnull 같은 기능을 하는 함수
# 값이 na면 True, 정상이면 False
df5.isna()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True  False
3   True  False   True

In [ ]:
df5.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True  False
3   True  False   True

In [ ]:
# 값이 na면 False, 정상이면 True
df5.notna()

       0      1      2
0   True   True   True
1   True  False  False
2  False  False   True
3  False   True  False

In [ ]:
# 값이 na면 False, 정상이면 True
df5.notnull()

       0      1      2
0   True   True   True
1   True  False  False
2  False  False   True
3  False   True  False

In [ ]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      float64
 1   1       2 non-null      float64
 2   2       2 non-null      float64
dtypes: float64(3)
memory usage: 224.0 bytes

In [ ]:
# 각 열 별 혹은 행 별 na/정상 데이터 수를 보기 위해 sum을 출력
# 열 별 na 수
df5.isna().sum()

0    2
1    2
2    2
dtype: int64

In [ ]:
# 행 별 na 수
df5.isna().sum(axis=1)

0    0
1    2
2    2
3    2
dtype: int64

In [ ]:
# 열 별 정상 데이터 수
df5.notna().sum()

0    2
1    2
2    2
dtype: int64

In [ ]:
# 행 별 정상 데이터 수
df5.notna().sum(axis=1)

0    3
1    1
2    1
3    1
dtype: int64

In [ ]:
# 전체 na/정상 데이터 수는 sum().sum() 혹은 sum(axis=1).sum()
df5.isna().sum().sum(), df5.isna().sum(axis=1).sum()

(6, 6)

In [ ]:
df5.notna().sum().sum(), df5.notna().sum(axis=1).sum()

(6, 6)

In [ ]:
# 결측치 제거
# fillna
# axis=0 행 조회/삭제 기본 값
# axis=1 열 조회/삭제
# how='any'(기본 값) or 'all -> 'any'하나라도 na면 삭제, 'all'전부 na면 삭제
# thresh=None -> 행/열을 유지하기 위한 최소 정상 데이터 수 -> 이 값 미만이면 삭제
df5.dropna()

     0    1    2
0  1.0  6.5  3.0

In [ ]:
df5.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

In [ ]:
df5.dropna(thresh=2)

     0    1    2
0  1.0  6.5  3.0

In [ ]:
df5.dropna(thresh=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

In [ ]:
df5.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
df5.dropna(thresh=2, axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

In [ ]:
df5.dropna(thresh=3, axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
df5

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  NaN  NaN  3.3
3  NaN  6.0  NaN

In [ ]:
# 결측치 보간
# fillna
# value=None -> 특정 값으로 채움
# method=None -> ffill == pad, bfill == backfill
# axis=None -> 0 = 행(아래로 전달) 1 = 열(옆으로 전달)
# value 혹은 method 중 하나는 필수
df5.fillna(1000)

        0       1       2
0     1.0     6.5     3.0
1     1.2  1000.0  1000.0
2  1000.0  1000.0     3.3
3  1000.0     6.0  1000.0

In [ ]:
df5.fillna(df5.median())

     0     1     2
0  1.0  6.50  3.00
1  1.2  6.25  3.15
2  1.1  6.25  3.30
3  1.1  6.00  3.15

In [ ]:
df5.fillna(method='ffill')

     0    1    2
0  1.0  6.5  3.0
1  1.2  6.5  3.0
2  1.2  6.5  3.3
3  1.2  6.0  3.3

In [ ]:
df5.fillna(method='ffill', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  1.2  1.2
2  NaN  NaN  3.3
3  NaN  6.0  6.0

In [ ]:
df5.fillna(method='pad')

     0    1    2
0  1.0  6.5  3.0
1  1.2  6.5  3.0
2  1.2  6.5  3.3
3  1.2  6.0  3.3

In [ ]:
df5.fillna(method='pad', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  1.2  1.2
2  NaN  NaN  3.3
3  NaN  6.0  6.0

In [ ]:
df5.fillna(method='bfill')

     0    1    2
0  1.0  6.5  3.0
1  1.2  6.0  3.3
2  NaN  6.0  3.3
3  NaN  6.0  NaN

In [ ]:
df5.fillna(method='bfill', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  3.3  3.3  3.3
3  6.0  6.0  NaN

In [ ]:
df5.fillna(method='backfill')

     0    1    2
0  1.0  6.5  3.0
1  1.2  6.0  3.3
2  NaN  6.0  3.3
3  NaN  6.0  NaN

In [ ]:
df5.fillna(method='backfill', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.2  NaN  NaN
2  3.3  3.3  3.3
3  6.0  6.0  NaN

#### Apply

In [ ]:
df6 = pd.DataFrame(np.random.randn(5,4))
df6

          0         1         2         3
0 -0.350760  0.254404  0.390542 -0.177577
1 -1.485535 -1.354547 -0.037907 -0.137223
2 -0.371663  0.729134 -2.362390 -0.401965
3 -0.262829  2.021135  0.498351 -0.131670
4  0.309962 -0.222162  0.161108  1.734412

In [ ]:
# 외부 함수 적용
# apply()
# 열 별로 연산 가능
# axis=0이면 행에서 인덱스 찾음
# axis=1이면 열에서 인덱스 찾음

df6.apply(np.cumsum)

          0         1         2         3
0 -0.350760  0.254404  0.390542 -0.177577
1 -1.836295 -1.100143  0.352635 -0.314799
2 -2.207958 -0.371009 -2.009755 -0.716764
3 -2.470787  1.650126 -1.511404 -0.848435
4 -2.160825  1.427964 -1.350296  0.885977

In [ ]:
df6.apply(lambda x: x.max() - x.min())

0    1.795497
1    3.375682
2    2.860741
3    2.136378
dtype: float64

In [ ]:
def func(x):
    return x.max() - x.min()
df6.apply(func, axis=1)

0    0.741302
1    1.447628
2    3.091525
3    2.283964
4    1.956574
dtype: float64

In [ ]:
# 다른 예제!
data = {
    '종족':['고양이', '강아지', '인공지능', '인간'],
    '집사력': [10, 40, 50, 60]
}
df_new = pd.DataFrame(data, index=list('abcd'))
df_new

     종족  집사력
a   고양이   10
b   강아지   40
c  인공지능   50
d    인간   60

In [ ]:
# 종족이 인공지능이면 고양이면 집사력-5, 인공지능이면+100, 인간이면+1000을 수행하는 함수 적용
def 집사력보정(종족, 집사력):
  종족별보정도 = {'고양이':-5, '강아지':0, '인공지능':100, '인간':1000}
  return 종족별보정도[종족] + 집사력
df_new['보정집사력'] = df_new.apply(lambda x: 집사력보정(x['종족'], x['집사력']), axis=1)
df_new

     종족  집사력  보정집사력
a   고양이   10      5
b   강아지   40     40
c  인공지능   50    150
d    인간   60   1060

#### 데이터프레임 병합

In [ ]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2',' A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}, index=[0,1,2,3])
df1

     A   B   C   D
0   A0  B0  C0  D0
1   A1  B1  C1  D1
2   A2  B2  C2  D2
3   A3  B3  C3  D3

In [ ]:
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6',' A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
}, index=[3,5,6,7])
df2

     A   B   C   D
3   A4  B4  C4  D4
5   A5  B5  C5  D5
6   A6  B6  C6  D6
7   A7  B7  C7  D7

In [ ]:
# 인덱스가 겹치는 데이터프레임!
df3 = pd.DataFrame({
    'A': ['A8', 'A9', 'A10',' A11'],
    'B': ['B8', 'B9', 'B10', 'B11'],
    'C': ['C8', 'C9', 'C10', 'C11'],
    'D': ['D8', 'D9', 'D10', 'D11']
}, index=[1,2,3,4])
df3

      A    B    C    D
1    A8   B8   C8   D8
2    A9   B9   C9   D9
3   A10  B10  C10  D10
4   A11  B11  C11  D11

In [ ]:
# concat 함수
# axis=0 행 (밑으로 붙임)
# axis=1 열 (옆으로 붙임)
# join='outer' 없는 인덱스/레이블 다 포함 (없는 값은 NA)
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
3    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
1    A8   B8   C8   D8
2    A9   B9   C9   D9
3   A10  B10  C10  D10
4   A11  B11  C11  D11

In [ ]:
# outer join이기 때문에 다 포함시키고 없는 값은 NA
pd.concat([df1, df2, df3], axis=1)

     A    B    C    D    A    B    C    D     A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN   NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN    A8   B8   C8   D8
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN    A9   B9   C9   D9
3   A3   B3   C3   D3   A4   B4   C4   D4   A10  B10  C10  D10
4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A11  B11  C11  D11
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5   NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6   NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7   NaN  NaN  NaN  NaN

In [ ]:
# 겹치는 3번 행만 남았음!
pd.concat([df1, df2, df3], axis=1, join='inner')

     A   B   C   D   A   B   C   D    A    B    C    D
3   A3  B3  C3  D3  A4  B4  C4  D4  A10  B10  C10  D10

In [ ]:
# keys에 추가 인덱스로 지정할 값을 넣으면 행 혹은 열에 계층 구조적 인덱스 추가
df = pd.concat([df1, df2, df3], keys=['X','Y','Z'])
df

        A    B    C    D
X 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
Y 3    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
Z 1    A8   B8   C8   D8
  2    A9   B9   C9   D9
  3   A10  B10  C10  D10
  4   A11  B11  C11  D11

In [ ]:
df['A']['X']

0     A0
1     A1
2     A2
3     A3
Name: A, dtype: object

In [ ]:
pd.concat([df1, df2, df3], keys=['X','Y'])

       A   B   C   D
X 0   A0  B0  C0  D0
  1   A1  B1  C1  D1
  2   A2  B2  C2  D2
  3   A3  B3  C3  D3
Y 3   A4  B4  C4  D4
  5   A5  B5  C5  D5
  6   A6  B6  C6  D6
  7   A7  B7  C7  D7

In [ ]:
pd.concat([df1, df2, df3], keys=['X','Y','Z', 'A'])

        A    B    C    D
X 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
Y 3    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
Z 1    A8   B8   C8   D8
  2    A9   B9   C9   D9
  3   A10  B10  C10  D10
  4   A11  B11  C11  D11

In [ ]:
pd.concat([df1, df2, df3], axis=1)

     A    B    C    D    A    B    C    D     A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN   NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN    A8   B8   C8   D8
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN    A9   B9   C9   D9
3   A3   B3   C3   D3   A4   B4   C4   D4   A10  B10  C10  D10
4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A11  B11  C11  D11
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5   NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6   NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7   NaN  NaN  NaN  NaN

In [ ]:
df = pd.concat([df1, df2, df3], axis=1, keys=['x', 'y', 'z'])
df

     x                   y                    z
     A    B    C    D    A    B    C    D     A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN   NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN    A8   B8   C8   D8
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN    A9   B9   C9   D9
3   A3   B3   C3   D3   A4   B4   C4   D4   A10  B10  C10  D10
4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A11  B11  C11  D11
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5   NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6   NaN  NaN  NaN  NaN
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7   NaN  NaN  NaN  NaN

In [ ]:
df = pd.concat([df1, df2, df3], axis=1, join='inner')
df

     A   B   C   D   A   B   C   D    A    B    C    D
3   A3  B3  C3  D3  A4  B4  C4  D4  A10  B10  C10  D10

In [ ]:
# 계층 구조로 된 인덱스 접근 방법
# tuple로 (level0, level1...)
df.loc[0, ('x', 'A')]

'A0'

In [ ]:
# 혹은 단계 별로 액세스
df.loc[0, ['x']]['x']['A']

'A0'

In [ ]:
# 시리즈도 병합 가능!
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([5,6,7,8])

# axis=0으로 병합하면 여전히 시리즈
pd.concat([s1, s2])

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
dtype: int64

In [ ]:
# axis=1로 병합하면 데이터프레임!
pd.concat([s1, s2], axis=1)

   0  1
0  1  5
1  2  6
2  3  7
3  4  8

In [ ]:
d1 = pd.DataFrame([1,2,3,4])
d1

   0
0  1
1  2
2  3
3  4

In [ ]:
# 데이터프레임 + 시리즈도 가능!
pd.concat([d1, s1, s2])

   0
0  1
1  2
2  3
3  4
0  1
1  2
2  3
3  4
0  5
1  6
2  7
3  8

In [ ]:
# 열 인덱스가 두 개가 되었다..
pd.concat([d1, s1, s2],axis=1)

   0  0  1
0  1  1  5
1  2  2  6
2  3  3  7
3  4  4  8

In [ ]:
# keys로 해결
pd.concat([d1, s1, s2],axis=1, keys=['d1', 's1', 's2'])

  d1 s1 s2
   0  0  1
0  1  1  5
1  2  2  6
2  3  3  7
3  4  4  8

In [ ]:
# merge
left = pd.DataFrame({
    'key' : ['K1', 'K2', 'K3', 'K4', 'K6'],
    'lval' : [1, 2, 3, 8, 9] 
})
left

  key  lval
0  K1     1
1  K2     2
2  K3     3
3  K4     8
4  K6     9

In [ ]:
right = pd.DataFrame({
    'key' : ['K0', 'K1', 'K3', 'K4', 'K5'],
    'rval' : [4, 5, 6, 7, 0]
})
right

  key  rval
0  K0     4
1  K1     5
2  K3     6
3  K4     7
4  K5     0

In [ ]:
left2 = pd.DataFrame({
    'lval' : [1, 2, 2, 3, 9],
    'key' : ['K1', 'K2', 'K3', 'K4', 'K6'],
    'key2' : ['K31', 'K32', 'K33', 'K34', 'K36']
})
left2

   lval key key2
0     1  K1  K31
1     2  K2  K32
2     2  K3  K33
3     3  K4  K34
4     9  K6  K36

In [ ]:
right2 = pd.DataFrame({
    'rval' : [1, 2, 3, 8, 9],
    'key' : ['K0', 'K1', 'K3', 'K4', 'K5'],
    'key2' : ['K31', 'K32', 'K33', 'K34', 'K36']
})
right2

   rval key key2
0     1  K0  K31
1     2  K1  K32
2     3  K3  K33
3     8  K4  K34
4     9  K5  K36

In [ ]:
display(left)
display(right)

  key  lval
0  K1     1
1  K2     2
2  K3     3
3  K4     8
4  K6     9

  key  rval
0  K0     4
1  K1     5
2  K3     6
3  K4     7
4  K5     0

In [ ]:
# merge 특정 열을 기준으로 합침
# on=열 레이블/배열/리스트
# how='inner' 여러 열이 같은 값인지 확인 후 inner (범주형 데이터만 대상)
pd.merge(left, right)

  key  lval  rval
0  K1     1     5
1  K3     3     6
2  K4     8     7

In [ ]:
display(left2)
display(right2)

   lval key key2
0     1  K1  K31
1     2  K2  K32
2     2  K3  K33
3     3  K4  K34
4     9  K6  K36

   rval key key2
0     1  K0  K31
1     2  K1  K32
2     3  K3  K33
3     8  K4  K34
4     9  K5  K36

In [ ]:
# 모든 공통 열(key, key2)의 값이 같은 행만 남음 (inner)
pd.merge(left2, right2)

   lval key key2  rval
0     2  K3  K33     3
1     3  K4  K34     8

In [ ]:
# on에 특정 열을 지정하는 경우 해당 열 값이 같은 행만 남음 (inner)
pd.merge(left, right, on='key', how='inner')

  key  lval  rval
0  K1     1     5
1  K3     3     6
2  K4     8     7

In [ ]:
# 공통 열이지만 지정되지 않은 key2는 각 데이터프레임에 있던 값이 key2_x, key2_y로 모두 추가됨
pd.merge(left2, right2, on='key', how='inner')

   lval key key2_x  rval key2_y
0     1  K1    K31     2    K32
1     2  K3    K33     3    K33
2     3  K4    K34     8    K34

In [ ]:
# how='left'인 경우 앞 데이터프레임에 맞춰짐
pd.merge(left, right, on='key', how='left')

  key  lval  rval
0  K1     1   5.0
1  K2     2   NaN
2  K3     3   6.0
3  K4     8   7.0
4  K6     9   NaN

In [ ]:
# how='right'인 경우 뒷 데이터프레임에 맞춰짐
pd.merge(left, right, on='key', how='right')

  key  lval  rval
0  K0   NaN     4
1  K1   1.0     5
2  K3   3.0     6
3  K4   8.0     7
4  K5   NaN     0

In [ ]:
# how='outer'인 경우 두 데이터프레임의 key 열 값을 모두 포함시킴
# 없는 값들은 NA
pd.merge(left, right, on='key', how='outer').sort_values(by='key').reset_index().drop('index', axis=1)

  key  lval  rval
0  K0   NaN   4.0
1  K1   1.0   5.0
2  K2   2.0   NaN
3  K3   3.0   6.0
4  K4   8.0   7.0
5  K5   NaN   0.0
6  K6   9.0   NaN

In [ ]:
# 공통 열이 여러 개인 경우 여러 개 전달 가능
pd.merge(left2, right2, on=['key', 'key2'], how='inner')

   lval key key2  rval
0     2  K3  K33     3
1     3  K4  K34     8

#### 그룹화

In [ ]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A' : ['foo', 'bar', 'foo', 'bar'],
    'B' : ['one', 'two', 'one', 'three'],
    'C' : np.random.randn(4),
    'D' : np.random.randn(4)
})
df

     A      B         C         D
0  foo    one -0.530038  1.509657
1  bar    two -1.076159 -0.716307
2  foo    one  0.533432 -1.188091
3  bar  three  0.924281 -0.049006

In [ ]:
# groupby
# 범주형 열을 지정하여 열의 범주 클래스 별로 데이터를 묶음
# 동일 클래스의 여러 개 있을 수 있기 때문에 통계 함수를 적용하여 출력 (예: 평균)
# groupby(열 레이블/리스트)
df.groupby('A')

In [ ]:
# 리스트로 전달
df.groupby(['A', 'B'])

In [ ]:
# 그룹화 후 인덱싱 가능
df.groupby('A')['D']

In [ ]:
# 그룹화 후 팬시 인덱싱 가능
df.groupby('A')[['D']]

In [ ]:
# 그룹화 후 슬라이싱 불가능
df.groupby('A')['C':'D']

TypeError: ignored

In [ ]:
# 그룹화 후 통계 함수 적용
# 적용 대상은 해당 통계 함수의 적용 대상에 영향 받음
df.groupby('A').sum()

            C         D
A
bar -0.191956 -0.854238
foo  0.992665  2.679812

In [ ]:
# 팬시 인덱싱->통계의 결과는 데이터프레임
df.groupby('A')[['D']].sum()

            D
A
bar -0.854238
foo  2.679812

In [ ]:
# 인덱싱 -> 통계의 결과는 시리즈
df.groupby('A')['C'].sum()

A
bar    0.859531
foo    1.028192
Name: C, dtype: float64

In [ ]:
# sum 통계 함수는 숫자열을 대상으로 하지만 임의로 문자열로 된 열을 선택하면, 
# 연산이 가능한 경우 수행
# + 결합 연산이 수행되었음
df.groupby('A')['B'].sum()

A
bar    twothree
foo      oneone
Name: B, dtype: object

In [ ]:
df

     A      B         C         D
0  foo    one -0.530038  1.509657
1  bar    two -1.076159 -0.716307
2  foo    one  0.533432 -1.188091
3  bar  three  0.924281 -0.049006

In [ ]:
# 여러 열을 기준으로 그룹화하는 경우
# 첫 인덱스가 최상위 레벨 인덱스로 지정됨 (계층 구조)
# groupby는 그룹화에 사용된 열이 object 타입의 범주형 데이터인 경우 모든 경우의 수가 아닌 실제 존재하는 데이터만 출력
# object 타입이 아닌 categorical 타입이라면 가능한 모든 경우의 수를 다 출력 (없는 데이터는 NA)
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar three -0.640879 -0.749236
    two    0.448923 -0.105002
foo one    0.992665  2.679812

In [ ]:
df2 = df.copy()

In [ ]:
df2['B'] = pd.Categorical(df2['B'])
df2['B'].dtype

CategoricalDtype(categories=['one', 'three', 'two'], ordered=False)

In [ ]:
df2.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one         NaN       NaN
    three -0.640879 -0.749236
    two    0.448923 -0.105002
foo one    0.992665  2.679812
    three       NaN       NaN
    two         NaN       NaN

In [ ]:
# ger_group
# 같은 그룹으로 묶인 데이터 행 출력
df.groupby('A').get_group('foo')

     A    B         C         D
0  foo  one  0.414364  2.085740
2  foo  one  0.578301  0.594071

In [ ]:
df.groupby('A').get_group('bar')

     A      B         C         D
1  bar    two  0.448923 -0.105002
3  bar  three -0.640879 -0.749236

In [ ]:
# size 함수 
# 클래스 별 값의 개수 
# size는 na를 포함하여 카운트 (열 별로 볼 필요 없음)
df.groupby('A').size()

A
bar    2
foo    2
dtype: int64

In [ ]:
# count는 na 미포함 (따라서 열 별로 볼 필요가 있음)
df.groupby('A').count()

     B  C  D
A
bar  2  2  2
foo  2  2  2

In [ ]:
# agg 함수
# 여러 통계 함수를 전달할 수 있음
# groupyb(열).agg(['통계함수명'])
df.groupby('A').agg(['mean'])

            C         D
         mean      mean
A
bar -0.095978 -0.427119
foo  0.496333  1.339906

In [ ]:
# 대괄호로 묶지 않으면 통계명 이름은 출력 안 됨
df.groupby('A').agg('mean')

            C         D
A
bar -0.095978 -0.427119
foo  0.496333  1.339906

In [ ]:
# 여러 개 전달 가능
df.groupby('A').agg(['mean', 'count'])

            C               D
         mean count      mean count
A
bar -0.095978     2 -0.427119     2
foo  0.496333     2  1.339906     2

In [ ]:
# as_index를 False로 지정하면 그룹화에 사용된 클래스가 인덱스 자리가 아닌 원래 열 자리에서 묶임
df.groupby('A', as_index=False).agg('sum')

     A         C         D
0  bar -0.191956 -0.854238
1  foo  0.992665  2.679812

In [ ]:
# 그룹화 후 각 열 별로 다른 통계 값을 출력하고 싶을 경우
# agg 함수에 사전의 형태로 전달
# {열:함수, 열:함수}
df.groupby('A').agg({'C':['sum'], 'D':[np.mean]})

            C         D
          sum      mean
A
bar -0.191956 -0.427119
foo  0.992665  1.339906

In [ ]:
# 각 열마다 다른 개수의 통계 함수 전달 가능
df.groupby('A').agg({'C':['sum', 'mean'], 'D':[np.mean]})

            C                   D
          sum      mean      mean
A
bar -0.191956 -0.095978 -0.427119
foo  0.992665  0.496333  1.339906

### 피벗 테이블

In [ ]:
import seaborn as sns
flights = sns.load_dataset("flights") 
flights.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [ ]:
# pivot
# 피벗 테이블을 생성하는 함수
# 행과 열에 각각 범주형 혹은 이산형 데이터를 지정할 수 있음(하나씩은 지정해야 피벗 테이블)
# 단 pivot 함수는 같은 케이스에 여러 값을 인정하지 않기 때문에 중복 값이 없는 경우에만 적용
flights.pivot(values='passengers', index='month', columns='year')

year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472
Jun     135   149   178   218   243   264   315   374   422   435   472   535
Jul     148   170   199   230   264   302   364   413   465   491   548   622
Aug     148   170   199   242   272   293   347   405   467   505   559   606
Sep     136   158   184   209   237   259   312   355   404   404   463   508
Oct     119   133   162   191   211   229   274   306   347   359   407   461
Nov     104   114   146   172   180   203   237   271   305   310   362   390
Dec     118   140   166   194   201   229   278   306   336   337   405   432

In [ ]:
flights.pivot_table(values='passengers', index='month', columns='year')

year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472
Jun     135   149   178   218   243   264   315   374   422   435   472   535
Jul     148   170   199   230   264   302   364   413   465   491   548   622
Aug     148   170   199   242   272   293   347   405   467   505   559   606
Sep     136   158   184   209   237   259   312   355   404   404   463   508
Oct     119   133   162   191   211   229   274   306   347   359   407   461
Nov     104   114   146   172   180   203   237   271   305   310   362   390
Dec     118   140   166   194   201   229   278   306   336   337   405   432

In [ ]:
# pivot_table
# 피벗 테이블을 생성하는 함수
# 행과 열에 각각 범주형 혹은 이산형 데이터를 지정할 수 있음(하나씩은 지정해야 피벗 테이블)
# 같은 케이스에 여러 개 공통 값이 있는 것을 용인 -> 통계 함수를 지정해야 함 (기본은 평균)
import seaborn as sns
tips = sns.load_dataset("tips") 
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
# aggfunc 기본은 mean
# pivot_table은 groupby와 다르게 모든 경우의 수를 다 표현하기 때문에 경우에 따라 na가 발생할 수 있음
# fill_value를 통해 na 처리 값을 지정할 수 있음
tips.pivot_table(index=['sex', 'day'], columns='smoker',values=['total_bill', 'tip'])

                  tip           total_bill
smoker            Yes        No        Yes         No
sex    day
Male   Thur  3.058000  2.941500  19.171000  18.486500
       Fri   2.741250  2.500000  20.452500  17.475000
       Sat   2.879259  3.256563  21.837778  19.929063
       Sun   3.521333  3.115349  26.141333  20.403256
Female Thur  2.990000  2.459600  19.218571  16.014400
       Fri   2.682857  3.125000  12.654286  19.365000
       Sat   2.868667  2.724615  20.266667  19.003846
       Sun   3.500000  3.329286  16.540000  20.824286

In [ ]:
# aggfunc을 통해 출력 통계 함수를 변경할 수 있음
pd.pivot_table(tips, index=['day'], columns=['sex'], values=['tip'], aggfunc='sum')

         tip
sex     Male Female
day
Thur   89.41  82.42
Fri    26.93  25.03
Sat   181.95  78.45
Sun   186.78  60.61

In [ ]:
# groupby에서와 마찬가지로 통계 함수 전달 시 리스트로 전달하면 통계 함수 이름이 노출됨
pd.pivot_table(tips, index=['day'], columns=['sex'], values=['tip'], aggfunc=['sum'])

         sum
         tip
sex     Male Female
day
Thur   89.41  82.42
Fri    26.93  25.03
Sat   181.95  78.45
Sun   186.78  60.61

In [ ]:
# aggfunc에 여러 통계 함수를 전달할 수 있음
pd.pivot_table(tips, index=['day'], columns=['sex'], values=['tip'], 
               aggfunc=[np.mean, np.sum])

          mean               sum
           tip               tip
sex       Male    Female    Male Female
day
Thur  2.980333  2.575625   89.41  82.42
Fri   2.693000  2.781111   26.93  25.03
Sat   3.083898  2.801786  181.95  78.45
Sun   3.220345  3.367222  186.78  60.61

### 연속형 데이터를 범주형으로 변경

In [ ]:
df = pd.DataFrame({'정수': np.random.randint(0,20,20), '실수': np.random.randn(20)})
df

    정수        실수
0   13 -1.654517
1   16  0.290545
2   14 -2.370375
3   19 -0.352969
4    7 -0.079041
5   12 -1.742028
6   10 -0.336266
7   12 -0.269583
8    7 -0.200764
9   17 -0.538244
10  14  0.928846
11  13  0.798943
12  17  1.265652
13   2 -0.516415
14   6 -0.286332
15   2  0.257263
16   3 -1.201427
17  17 -1.058414
18  17 -1.676025
19   7  0.791141

In [ ]:
# cut
# 최대~최소를 기준으로 동일 간격으로 나눔 (개수 지정->linspace처럼!)
# 각 데이터가 어떤 구간에 속하는지 구간 값으로 반환
# 각 구간은 앞 구간부터 뒷 구간까지 순서(크기) 정보가 생김 (범주형 중 순서형)
cat_dec = pd.cut(df['정수'], 4)
cat_dec

0     (-0.018, 4.5]
1     (-0.018, 4.5]
2     (-0.018, 4.5]
3       (9.0, 13.5]
4        (4.5, 9.0]
5     (-0.018, 4.5]
6      (13.5, 18.0]
7        (4.5, 9.0]
8      (13.5, 18.0]
9      (13.5, 18.0]
10       (4.5, 9.0]
11     (13.5, 18.0]
12    (-0.018, 4.5]
13     (13.5, 18.0]
14      (9.0, 13.5]
15       (4.5, 9.0]
16     (13.5, 18.0]
17    (-0.018, 4.5]
18      (9.0, 13.5]
19     (13.5, 18.0]
Name: 정수, dtype: category
Categories (4, interval[float64]): [(-0.018, 4.5] < (4.5, 9.0] < (9.0, 13.5] < (13.5, 18.0]]

In [ ]:
df['정수']

0     13
1     16
2     14
3     19
4      7
5     12
6     10
7     12
8      7
9     17
10    14
11    13
12    17
13     2
14     6
15     2
16     3
17    17
18    17
19     7
Name: 정수, dtype: int64

In [ ]:
# labels에 각 구간 별 이름을 지정할 수 있음
cat_dec = pd.cut(df['정수'], 4, labels=['1구간', '2구간', '3구간', '4구간'])
cat_dec

0     1구간
1     1구간
2     1구간
3     3구간
4     2구간
5     1구간
6     4구간
7     2구간
8     4구간
9     4구간
10    2구간
11    4구간
12    1구간
13    4구간
14    3구간
15    2구간
16    4구간
17    1구간
18    3구간
19    4구간
Name: 정수, dtype: category
Categories (4, object): ['1구간' < '2구간' < '3구간' < '4구간']

In [ ]:
df['정수_cat'] = cat_dec
df.groupby('정수_cat').agg(['count','mean', 'sum', 'min', 'max'])

          정수                      ...        실수
       count       mean  sum min  ...      mean       sum       min       max
정수_cat                            ...
1구간        6   1.833333   11   0  ...  0.273911  1.643468 -0.716421  1.571290
2구간        4   8.250000   33   7  ...  0.433368  1.733472 -0.981633  1.930913
3구간        3  11.000000   33  10  ...  0.388181  1.164542 -1.122176  1.458257
4구간        7  15.714286  110  14  ...  0.106300  0.744098 -2.130636  1.743837

[4 rows x 10 columns]

In [ ]:
# linspace로 구간을 만들어서 전달할 수 있음
bins = np.linspace(df['정수'].min()-0.1, df['정수'].max()+0.1, 5)
bins

array([-0.1 ,  4.45,  9.  , 13.55, 18.1 ])

In [ ]:
cat_lin = pd.cut(df['정수'], bins, labels=['1구간', '2구간', '3구간', '4구간'])
cat_lin

0     1구간
1     1구간
2     1구간
3     3구간
4     2구간
5     1구간
6     4구간
7     2구간
8     4구간
9     4구간
10    2구간
11    4구간
12    1구간
13    4구간
14    3구간
15    2구간
16    4구간
17    1구간
18    3구간
19    4구간
Name: 정수, dtype: category
Categories (4, object): ['1구간' < '2구간' < '3구간' < '4구간']

In [ ]:
df['정수_lin'] = cat_lin

In [ ]:
df.groupby('정수_lin').agg(['count','mean', 'sum', 'min', 'max'])

          정수                      ...        실수
       count       mean  sum min  ...      mean       sum       min       max
정수_lin                            ...
1구간        6   1.833333   11   0  ...  0.273911  1.643468 -0.716421  1.571290
2구간        4   8.250000   33   7  ...  0.433368  1.733472 -0.981633  1.930913
3구간        3  11.000000   33  10  ...  0.388181  1.164542 -1.122176  1.458257
4구간        7  15.714286  110  14  ...  0.106300  0.744098 -2.130636  1.743837

[4 rows x 10 columns]

In [ ]:
# 혹은 임의의 구간을 설정하여 전달할 수 있음
# linspace로 구간을 만들어서 전달할 수 있음
bins2 = np.linspace(df['정수'].min()-0.1, df['정수'].max()+0.1, 5)
bins2

array([-0.1 ,  4.45,  9.  , 13.55, 18.1 ])

In [ ]:
bins2[1] = 1.2
bins2[2] = 4.5
bins2[3] = 17.9
bins2

array([-0.1,  1.2,  4.5, 17.9, 18.1])

In [ ]:
df

    정수        실수 정수_cat 정수_lin 정수_lin2
0    2  0.912196    1구간    1구간     1구간
1    3  0.561711    1구간    1구간     1구간
2    2 -0.562677    1구간    1구간     1구간
3   10 -1.122176    3구간    3구간     3구간
4    9  0.194105    2구간    2구간     2구간
5    0 -0.122632    1구간    1구간     1구간
6   14  1.743837    4구간    4구간     4구간
7    9  0.590087    2구간    2구간     2구간
8   15 -2.130636    4구간    4구간     4구간
9   17 -0.784830    4구간    4구간     4구간
10   8 -0.981633    2구간    2구간     2구간
11  18  0.174472    4구간    4구간     4구간
12   1  1.571290    1구간    1구간     1구간
13  14  0.341010    4구간    4구간     4구간
14  11  0.828461    3구간    3구간     3구간
15   7  1.930913    2구간    2구간     2구간
16  14  1.138344    4구간    4구간     4구간
17   3 -0.716421    1구간    1구간     1구간
18  12  1.458257    3구간    3구간     3구간
19  18  0.261902    4구간    4구간     4구간

In [ ]:
cat_lin2 = pd.cut(df['정수'], bins2, labels=['1구간', '2구간', '3구간', '4구간'])
cat_lin2

0     2구간
1     2구간
2     2구간
3     3구간
4     3구간
5     1구간
6     3구간
7     3구간
8     3구간
9     3구간
10    3구간
11    4구간
12    1구간
13    3구간
14    3구간
15    3구간
16    3구간
17    2구간
18    3구간
19    4구간
Name: 정수, dtype: category
Categories (4, object): ['1구간' < '2구간' < '3구간' < '4구간']

In [ ]:
df['정수_lin2'] = cat_lin2

In [ ]:
df.groupby('정수_lin2').agg(['count','mean', 'sum', 'min', 'max'])

           정수                      ...        실수
        count       mean  sum min  ...      mean       sum       min       max
정수_lin2                            ...
1구간         2   0.500000    1   0  ...  0.724329  1.448659 -0.122632  1.571290
2구간         4   2.500000   10   2  ...  0.048702  0.194810 -0.716421  0.912196
3구간        12  11.666667  140   7  ...  0.267145  3.205738 -2.130636  1.930913
4구간         2  18.000000   36  18  ...  0.218187  0.436374  0.174472  0.261902

[4 rows x 10 columns]

In [ ]:
# qcut
# 구간 개수를 지정하면 지정한 구간마다 동일한 개수의 샘플(행)이 배치되도록 구간을 조절함
cat_real = pd.qcut(df['실수'], 4, labels=['1구간', '2구간', '3구간', '4구간'] )
cat_real

0     3구간
1     3구간
2     2구간
3     1구간
4     2구간
5     2구간
6     4구간
7     3구간
8     1구간
9     1구간
10    1구간
11    2구간
12    4구간
13    3구간
14    3구간
15    4구간
16    4구간
17    1구간
18    4구간
19    2구간
Name: 실수, dtype: category
Categories (4, object): ['1구간' < '2구간' < '3구간' < '4구간']

In [ ]:
df['실수_cat'] = cat_real

In [ ]:
# count를 보면 개수가 같은 것을 확인할 수 있음!
df.groupby('실수_cat').agg(['count','mean', 'sum', 'min', 'max'])

          정수                      실수
       count  mean sum min max count      mean       sum       min       max
실수_cat
1구간        5  10.6  53   3  17     5 -1.147139 -5.735697 -2.130636 -0.716421
2구간        5   9.4  47   0  18     5 -0.010966 -0.054830 -0.562677  0.261902
3구간        5   7.8  39   2  14     5  0.646693  3.233466  0.341010  0.912196
4구간        5   9.6  48   1  14     5  1.568528  7.842641  1.138344  1.930913

#### 범주형(명목형 문자열) 데이터를 수치로

In [ ]:
data = {
    'name': ['Nathan', 'Link', 'Khajiit', 'Ratchet', 'Son'],
    'age':[40,21,200,12,29],
    'appearance': ['Uncharted', 'Zelda', 'Elder Scroll', 'Ratchet & Clank', 'EPL']
}
df = pd.DataFrame(data)
df

      name  age       appearance
0   Nathan   40        Uncharted
1     Link   21            Zelda
2  Khajiit  200     Elder Scroll
3  Ratchet   12  Ratchet & Clank
4      Son   29              EPL

In [ ]:
# label encoding
# 문자열을 정수로!
def labelencoding(x):
  mydict = {}
  mylist = np.unique(x)
  for i, v in enumerate(mylist):
    print(v, i)
    mydict[v] = i
  
  ret = []
  for i in x:
    ret.append(mydict[i])
  return np.array(ret)


labelencoding(df['name'])

Khajiit 0
Link 1
Nathan 2
Ratchet 3
Son 4

array([2, 1, 0, 3, 4])

In [ ]:
# sklearn 이용
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()
le.fit(df['name'])
print(le.classes_)
print(le.transform(df['name']))
print(le.inverse_transform(le.transform(df['name'])))

['Khajiit' 'Link' 'Nathan' 'Ratchet' 'Son']
[2 1 0 3 4]
['Nathan' 'Link' 'Khajiit' 'Ratchet' 'Son']

In [ ]:
# one-hot vector 생성
# get_dummies 함수
# 데이터프레임을 전달
# 모든 숫자 열은 df의 앞으로 이동하고, 문자열로 된 열은 one-hot vector로 바뀜
df2 = pd.get_dummies(df)
df2

   age  name_Khajiit  ...  appearance_Uncharted  appearance_Zelda
0   40             0  ...                     1                 0
1   21             0  ...                     0                 1
2  200             1  ...                     0                 0
3   12             0  ...                     0                 0
4   29             0  ...                     0                 0

[5 rows x 11 columns]

In [ ]:
df3 = df.copy()

In [ ]:
# 특정 열(시리즈)를 전달해도 one-vector의 데이터프레임으로 변경
df4 = pd.get_dummies(df['name'])
df_conc = pd.concat([df3, df4], axis=1)

In [ ]:
df_conc

      name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son
0   Nathan   40        Uncharted        0     0       1        0    0
1     Link   21            Zelda        0     1       0        0    0
2  Khajiit  200     Elder Scroll        1     0       0        0    0
3  Ratchet   12  Ratchet & Clank        0     0       0        1    0
4      Son   29              EPL        0     0       0        0    1

In [ ]:
df_conc.drop('name', axis=1)

   age       appearance  Khajiit  Link  Nathan  Ratchet  Son
0   40        Uncharted        0     0       1        0    0
1   21            Zelda        0     1       0        0    0
2  200     Elder Scroll        1     0       0        0    0
3   12  Ratchet & Clank        0     0       0        1    0
4   29              EPL        0     0       0        0    1

### 데이터프레임 저장 및 불러오기

In [ ]:
df_conc.index=list('abcde')
df_conc

      name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son
a   Nathan   40        Uncharted        0     0       1        0    0
b     Link   21            Zelda        0     1       0        0    0
c  Khajiit  200     Elder Scroll        1     0       0        0    0
d  Ratchet   12  Ratchet & Clank        0     0       0        1    0
e      Son   29              EPL        0     0       0        0    1

In [ ]:
df_conc.index.name = ''

In [ ]:
df_conc

      name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son

a   Nathan   40        Uncharted        0     0       1        0    0
b     Link   21            Zelda        0     1       0        0    0
c  Khajiit  200     Elder Scroll        1     0       0        0    0
d  Ratchet   12  Ratchet & Clank        0     0       0        1    0
e      Son   29              EPL        0     0       0        0    1

In [ ]:
# csv 파일로 저장 
# df.to_csv
df_conc.to_csv('test.csv', index=True)

In [ ]:
# csv 파일 읽기 -> df 생성
df = pd.read_csv('test.csv')
df

  Unnamed: 0     name  age       appearance  ...  Link  Nathan  Ratchet  Son
0          a   Nathan   40        Uncharted  ...     0       1        0    0
1          b     Link   21            Zelda  ...     1       0        0    0
2          c  Khajiit  200     Elder Scroll  ...     0       0        0    0
3          d  Ratchet   12  Ratchet & Clank  ...     0       0        1    0
4          e      Son   29              EPL  ...     0       0        0    1

[5 rows x 9 columns]

In [ ]:
df_tmp = df.set_index('Unnamed: 0')
df_tmp

               name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son
Unnamed: 0
a            Nathan   40        Uncharted        0     0       1        0    0
b              Link   21            Zelda        0     1       0        0    0
c           Khajiit  200     Elder Scroll        1     0       0        0    0
d           Ratchet   12  Ratchet & Clank        0     0       0        1    0
e               Son   29              EPL        0     0       0        0    1

In [ ]:
df_tmp.index.name = ''
df_tmp

      name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son

a   Nathan   40        Uncharted        0     0       1        0    0
b     Link   21            Zelda        0     1       0        0    0
c  Khajiit  200     Elder Scroll        1     0       0        0    0
d  Ratchet   12  Ratchet & Clank        0     0       0        1    0
e      Son   29              EPL        0     0       0        0    1

In [ ]:
# index=False
df_conc.to_csv('test1.csv', index=False)

In [ ]:
# csv 파일 읽기 -> df 생성
df2 = pd.read_csv('test1.csv')
df2

      name  age       appearance  Khajiit  Link  Nathan  Ratchet  Son
0   Nathan   40        Uncharted        0     0       1        0    0
1     Link   21            Zelda        0     1       0        0    0
2  Khajiit  200     Elder Scroll        1     0       0        0    0
3  Ratchet   12  Ratchet & Clank        0     0       0        1    0
4      Son   29              EPL        0     0       0        0    1

In [ ]:
# excel 파일로 저장 
# df.to_excel
df_conc.to_excel('test.xlsx', '주인공', index=True)

In [ ]:
df3 = pd.read_excel('test.xlsx')
df3

  Unnamed: 0     name  age       appearance  ...  Link  Nathan  Ratchet  Son
0          a   Nathan   40        Uncharted  ...     0       1        0    0
1          b     Link   21            Zelda  ...     1       0        0    0
2          c  Khajiit  200     Elder Scroll  ...     0       0        0    0
3          d  Ratchet   12  Ratchet & Clank  ...     0       0        1    0
4          e      Son   29              EPL  ...     0       0        0    1

[5 rows x 9 columns]